Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_spi.c
  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_SPI);

  /* spi config */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_DEG_EN, spiCfg->deglitchEnable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_M_CONT_EN, spiCfg->continuousEnable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_BYTE_INV, spiCfg->byteSequence);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_BIT_INV, spiCfg->bitSequence);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_SCLK_PH, (spiCfg->clkPhaseInv + 1) & 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_SCLK_POL, spiCfg->clkPolarity);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, spiCfg->frameSize);
  BL_WR_REG(SPIx, SPI_CONFIG, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(SPI_IRQn, SPI_IRQHandler);
#endif
  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI set default value of all registers function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_DeInit(SPI_ID_Type spiNo) {
  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  if (SPI_ID_0 == spiNo) {
    GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_SPI);
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Length of data phase1/0,start/stop condition and interval between frame initialization
                                                                                *         function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  clockCfg: Clock configuration structure pointer
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_ClockConfig(SPI_ID_Type spiNo, SPI_ClockCfg_Type *clockCfg) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Configure length of data phase1/0 and start/stop condition */
  tmpVal = BL_RD_REG(SPIx, SPI_PRD_0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_S, clockCfg->startLen - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_P, clockCfg->stopLen - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_D_PH_0, clockCfg->dataPhase0Len - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_D_PH_1, clockCfg->dataPhase1Len - 1);
  BL_WR_REG(SPIx, SPI_PRD_0, tmpVal);

  /* Configure length of interval between frame */
  tmpVal = BL_RD_REG(SPIx, SPI_PRD_1);
  BL_WR_REG(SPIx, SPI_PRD_1, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_I, clockCfg->intervalLen - 1));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI configure fifo function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  fifoCfg: FIFO configuration structure pointer
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_FifoConfig(SPI_ID_Type spiNo, SPI_FifoCfg_Type *fifoCfg) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Set fifo threshold value */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_TX_FIFO_TH, fifoCfg->txFifoThreshold);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_RX_FIFO_TH, fifoCfg->rxFifoThreshold);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_1, tmpVal);

  /* Enable or disable dma function */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_DMA_TX_EN, fifoCfg->txFifoDmaEnable);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_DMA_RX_EN, fifoCfg->rxFifoDmaEnable);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Set SPI SCK Clcok
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  clk: Clk
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_SetClock(SPI_ID_Type spiNo, uint32_t clk) {
  uint32_t glb_div = 1, spi_div = 1;
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  if (clk > 36000000) {
    clk     = 36000000;
    glb_div = 1;
    spi_div = 1;
  } else if (clk > 140625) {
    glb_div = 1;
    spi_div = 36000000 / clk;
  } else if (clk > 70312) {
    glb_div = 2;
    spi_div = 18000000 / clk;
  } else if (clk > 35156) {
    glb_div = 4;
    spi_div = 9000000 / clk;
  } else if (clk > 4394) {
    glb_div = 32;
    spi_div = 1125000 / clk;
  } else {
    glb_div = 32;
    spi_div = 256;
  }

  /* Configure length of data phase1/0 and start/stop condition */
  tmpVal = BL_RD_REG(SPIx, SPI_PRD_0);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_S, spi_div - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_P, spi_div - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_D_PH_0, spi_div - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_D_PH_1, spi_div - 1);
  BL_WR_REG(SPIx, SPI_PRD_0, tmpVal);

  tmpVal = BL_RD_REG(SPIx, SPI_PRD_1);
  BL_WR_REG(SPIx, SPI_PRD_1, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_PRD_I, spi_div - 1));

  GLB_Set_SPI_CLK(ENABLE, glb_div - 1);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Enable spi transfer
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  modeType: Master or slave mode select
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_Enable(SPI_ID_Type spiNo, SPI_WORK_MODE_Type modeType) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_WORK_MODE_TYPE(modeType));

