Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_spi.c
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);

  if (modeType != SPI_WORK_MODE_SLAVE) {
    /* master mode */
    tmpVal = BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_S_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_CR_SPI_M_EN);
  } else {
    /* slave mode */
    tmpVal = BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_M_EN);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_CR_SPI_S_EN);
  }

  BL_WR_REG(SPIx, SPI_CONFIG, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Disable spi transfer
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  modeType: Master or slave mode select
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_Disable(SPI_ID_Type spiNo, SPI_WORK_MODE_Type modeType) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_WORK_MODE_TYPE(modeType));

  /* close master and slave */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_M_EN);
  tmpVal = BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_S_EN);
  BL_WR_REG(SPIx, SPI_CONFIG, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Set time-out value to trigger interrupt when spi bus is idle for the given value
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  value: Time value
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_SetTimeOutValue(SPI_ID_Type spiNo, uint16_t value) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Set time-out value */
  tmpVal = BL_RD_REG(SPIx, SPI_STO_VALUE);
  BL_WR_REG(SPIx, SPI_STO_VALUE, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_STO_VALUE, value - 1));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Set de-glitch function cycle count value
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  cnt: De-glitch function cycle count
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_SetDeglitchCount(SPI_ID_Type spiNo, uint8_t cnt) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Set count value */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_DEG_CNT, cnt);
  BL_WR_REG(SPIx, SPI_CONFIG, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Enable rx data ignore function and set start/stop point
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  startPoint: Start point
                                                                                * @param  stopPoint: Stop point
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_RxIgnoreEnable(SPI_ID_Type spiNo, uint8_t startPoint, uint8_t stopPoint) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Enable rx ignore function */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

  /* Set start and stop point */
  tmpVal = startPoint << SPI_CR_SPI_RXD_IGNR_S_POS | stopPoint;
  BL_WR_REG(SPIx, SPI_RXD_IGNR, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Disable rx data ignore function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_RxIgnoreDisable(SPI_ID_Type spiNo) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Disable rx ignore function */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Clear tx fifo and tx fifo overflow/underflow status
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_ClrTxFifo(SPI_ID_Type spiNo) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Clear tx fifo */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Clear rx fifo and rx fifo overflow/underflow status
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_ClrRxFifo(SPI_ID_Type spiNo) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Clear rx fifo */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Clear spi interrupt status
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  intType: SPI interrupt type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_ClrIntStatus(SPI_ID_Type spiNo, SPI_INT_Type intType) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Clear certain or all interrupt */
  tmpVal = BL_RD_REG(SPIx, SPI_INT_STS);

  if (SPI_INT_ALL == intType) {
    tmpVal |= 0x1f << SPI_CR_SPI_END_CLR_POS;
  } else {
    tmpVal |= 1 << (intType + SPI_CR_SPI_END_CLR_POS);
  }

  BL_WR_REG(SPIx, SPI_INT_STS, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI mask or unmask certain or all interrupt
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  intType: SPI interrupt type
                                                                                * @param  intMask: SPI interrupt mask value( MASK:disbale interrupt,UNMASK:enable interrupt )
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_IntMask(SPI_ID_Type spiNo, SPI_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  tmpVal = BL_RD_REG(SPIx, SPI_INT_STS);

  /* Mask or unmask certain or all interrupt */
  if (SPI_INT_ALL == intType) {
    if (MASK == intMask) {
      tmpVal |= 0x3f << SPI_CR_SPI_END_MASK_POS;
    } else {
      tmpVal &= ~(0x3f << SPI_CR_SPI_END_MASK_POS);
    }
  } else {
    if (MASK == intMask) {
      tmpVal |= 1 << (intType + SPI_CR_SPI_END_MASK_POS);
    } else {
      tmpVal &= ~(1 << (intType + SPI_CR_SPI_END_MASK_POS));
    }
  }

  /* Write back */
  BL_WR_REG(SPIx, SPI_INT_STS, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Install spi interrupt callback function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  intType: SPI interrupt type
                                                                                * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_Int_Callback_Install(SPI_ID_Type spiNo, SPI_INT_Type intType, intCallback_Type *cbFun) {
  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_INT_TYPE(intType));

