Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_spi.c
  spiIntCbfArra[spiNo][intType] = cbFun;

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI write data to tx fifo
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  data: Data to write
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_SendData(SPI_ID_Type spiNo, uint32_t data) {
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Write tx fifo */
  BL_WR_REG(SPIx, SPI_FIFO_WDATA, data);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI send 8-bit datas
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  buff: Buffer of datas
                                                                                * @param  length: Length of buffer
                                                                                * @param  timeoutType: Enable or disable timeout judgment
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_Send_8bits(SPI_ID_Type spiNo, uint8_t *buff, uint32_t length, SPI_Timeout_Type timeoutType) {
  uint32_t tmpVal;
  uint32_t txLen = 0;
  uint32_t rData;
  uint32_t SPIx       = spiAddr[spiNo];
  uint32_t timeoutCnt = SPI_TX_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

  /* Set valid width for each fifo entry */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, 0));

  /* Disable rx ignore */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

  /* Clear tx and rx fifo */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

  /* Fill tx fifo */
  tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

  for (txLen = 0; txLen < tmpVal; txLen++) {
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, (uint32_t)buff[txLen]);
  }

  /* Wait receive data and send the rest of the data */
  for (; txLen < length; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, (uint32_t)buff[txLen]);
  }

  /* Wait receive the rest of the data */
  for (txLen = 0; txLen < tmpVal; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    rData |= BL_RD_REG(SPIx, SPI_FIFO_RDATA);
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI send 16-bit datas
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  buff: Buffer of datas
                                                                                * @param  length: Length of buffer
                                                                                * @param  timeoutType: Enable or disable timeout judgment
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_Send_16bits(SPI_ID_Type spiNo, uint16_t *buff, uint32_t length, SPI_Timeout_Type timeoutType) {
  uint32_t tmpVal;
  uint32_t txLen = 0;
  uint32_t rData;
  uint32_t SPIx       = spiAddr[spiNo];
  uint32_t timeoutCnt = SPI_TX_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

  /* Set valid width for each fifo entry */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, 1));

