Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_spi.c
  /* Disable rx ignore */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

  /* Clear tx and rx fifo */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

  /* Fill tx fifo */
  tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

  for (txLen = 0; txLen < tmpVal; txLen++) {
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, (uint32_t)sendBuff[txLen]);
  }

  /* Wait receive data and send the rest of the data */
  for (; txLen < length; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    recvBuff[txLen - tmpVal] = (uint16_t)(BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xffff);
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, (uint32_t)sendBuff[txLen]);
  }

  /* Wait receive the rest of the data */
  for (txLen = 0; txLen < tmpVal; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    recvBuff[length - tmpVal + txLen] = (uint16_t)(BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xffff);
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI send and receive 24-bit datas at the same time
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  sendBuff: Buffer of datas to send
                                                                                * @param  recvBuff: Buffer of datas received
                                                                                * @param  length: Length of buffer
                                                                                * @param  timeoutType: Enable or disable timeout judgment
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_SendRecv_24bits(SPI_ID_Type spiNo, uint32_t *sendBuff, uint32_t *recvBuff, uint32_t length, SPI_Timeout_Type timeoutType) {
  uint32_t tmpVal;
  uint32_t txLen      = 0;
  uint32_t SPIx       = spiAddr[spiNo];
  uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

  /* Set valid width for each fifo entry */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, 2));

  /* Disable rx ignore */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

  /* Clear tx and rx fifo */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

  /* Fill tx fifo */
  tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

  for (txLen = 0; txLen < tmpVal; txLen++) {
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
  }

  /* Wait receive data and send the rest of the data */
  for (; txLen < length; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    recvBuff[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xffffff;
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
  }

  /* Wait receive the rest of the data */
  for (txLen = 0; txLen < tmpVal; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    recvBuff[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xffffff;
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI send and receive 32-bit datas at the same time
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  sendBuff: Buffer of datas to send
                                                                                * @param  recvBuff: Buffer of datas received
                                                                                * @param  length: Length of buffer
                                                                                * @param  timeoutType: Enable or disable timeout judgment
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type SPI_SendRecv_32bits(SPI_ID_Type spiNo, uint32_t *sendBuff, uint32_t *recvBuff, uint32_t length, SPI_Timeout_Type timeoutType) {
  uint32_t tmpVal;
  uint32_t txLen      = 0;
  uint32_t SPIx       = spiAddr[spiNo];
  uint32_t timeoutCnt = SPI_RX_TIMEOUT_COUNT;

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_TIMEOUT_TYPE(timeoutType));

  /* Set valid width for each fifo entry */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, 3));

