Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_spi.c
  /* Disable rx ignore */
  tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
  BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

  /* Clear tx and rx fifo */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
  tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
  BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

  /* Fill tx fifo */
  tmpVal = length <= (SPI_TX_FIFO_SIZE) ? length : SPI_TX_FIFO_SIZE;

  for (txLen = 0; txLen < tmpVal; txLen++) {
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
  }

  /* Wait receive data and send the rest of the data */
  for (; txLen < length; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    recvBuff[txLen - tmpVal] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
    BL_WR_REG(SPIx, SPI_FIFO_WDATA, sendBuff[txLen]);
  }

  /* Wait receive the rest of the data */
  for (txLen = 0; txLen < tmpVal; txLen++) {
    timeoutCnt = SPI_RX_TIMEOUT_COUNT;

    while (SPI_GetRxFifoCount(spiNo) == 0) {
      if (timeoutType) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
          return TIMEOUT;
        }
      }
    }

    recvBuff[length - tmpVal + txLen] = BL_RD_REG(SPIx, SPI_FIFO_RDATA);
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  SPI read data from rx fifo
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return Data readed
                                                                                *
                                                                                *******************************************************************************/
uint32_t SPI_ReceiveData(SPI_ID_Type spiNo) {
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  return BL_RD_REG(SPIx, SPI_FIFO_RDATA);
}

/****************************************************************************/ /**
                                                                                * @brief  Get tx fifo available count value function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return Count value
                                                                                *
                                                                                *******************************************************************************/
uint8_t SPI_GetTxFifoCount(SPI_ID_Type spiNo) {
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Get count value */
  return BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_TX_FIFO_CNT);
}

/****************************************************************************/ /**
                                                                                * @brief  Get rx fifo available count value function
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return Count value
                                                                                *
                                                                                *******************************************************************************/
uint8_t SPI_GetRxFifoCount(SPI_ID_Type spiNo) {
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Get count value */
  return BL_GET_REG_BITS_VAL(BL_RD_REG(SPIx, SPI_FIFO_CONFIG_1), SPI_RX_FIFO_CNT);
}

/****************************************************************************/ /**
                                                                                * @brief  Get spi interrupt status
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  intType: SPI interrupt type
                                                                                *
                                                                                * @return Status of interrupt
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type SPI_GetIntStatus(SPI_ID_Type spiNo, SPI_INT_Type intType) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_INT_TYPE(intType));

  /* Get certain or all interrupt status */
  tmpVal = BL_RD_REG(SPIx, SPI_INT_STS);

  if (SPI_INT_ALL == intType) {
    if ((tmpVal & 0x3f) != 0) {
      return SET;
    } else {
      return RESET;
    }
  } else {
    if ((tmpVal & (1U << intType)) != 0) {
      return SET;
    } else {
      return RESET;
    }
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Get indicator of spi bus busy
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                *
                                                                                * @return Status of spi bus
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type SPI_GetBusyStatus(SPI_ID_Type spiNo) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));

  /* Get bus busy status */
  tmpVal = BL_RD_REG(SPIx, SPI_BUS_BUSY);

