Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_spi.c
  if (BL_IS_REG_BIT_SET(tmpVal, SPI_STS_SPI_BUS_BUSY)) {
    return SET;
  } else {
    return RESET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Get tx/rx fifo overflow or underflow status
                                                                                *
                                                                                * @param  spiNo: SPI ID type
                                                                                * @param  fifoSts: Select tx/rx overflow or underflow
                                                                                *
                                                                                * @return Status of tx/rx fifo
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type SPI_GetFifoStatus(SPI_ID_Type spiNo, SPI_FifoStatus_Type fifoSts) {
  uint32_t tmpVal;
  uint32_t SPIx = spiAddr[spiNo];

  /* Check the parameters */
  CHECK_PARAM(IS_SPI_ID_TYPE(spiNo));
  CHECK_PARAM(IS_SPI_FIFOSTATUS_TYPE(fifoSts));

  /* Get tx/rx fifo overflow or underflow status */
  tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);

  if ((tmpVal & (1U << (fifoSts + SPI_TX_FIFO_OVERFLOW_POS))) != 0) {
    return SET;
  } else {
    return RESET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  SPI interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void SPI_IRQHandler(void) { SPI_IntHandler(SPI_ID_0); }
#endif

/*@} end of group SPI_Public_Functions */

/*@} end of group SPI */

/*@} end of group BL702_Peripheral_Driver */
